Carregue o arquivo csv que você salvou na questão anterior e, em seguida, obtenha o que é solicitado nos itens elencados abaixo:

(a) A quantidade de abacates do tipo convecional e do tipo orgânico.

(b) A quantidade de registros (linhas) de abacates vendidos para cada região.

(c) Para que todos os labels das colunas fiquem padronizados, renomeie aqueles que estão iniciando em letra minúscula para que iniciem em letra maiúscula.

(d) Uma vez que você já possui uma coluna com a data, remova a coluna que apresenta o ano.

In [74]:
import os
import pandas as pd

In [75]:
df = pd.read_csv(r'db\avocado_with_type.csv')
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,year,region,type
0,0,2015-12-27,1.33,64236.62,2015,Albany,conventional
1,1,2015-12-20,1.35,54876.98,2015,Albany,conventional
2,2,2015-12-13,0.93,118220.22,2015,Albany,conventional
3,3,2015-12-06,1.08,78992.15,2015,Albany,conventional
4,4,2015-11-29,1.28,51039.60,2015,Albany,conventional

In [76]:
# Quantidade de abacates do tipo convecional e do tipo orgânico.

df['type'].value_counts()

conventional    9126
organic         9123
Name: type, dtype: int64

In [77]:
# Quantidade de registros (linhas) de abacates vendidos para cada região.

df['region'].value_counts()

Albany                 338
Sacramento             338
Northeast              338
NorthernNewEngland     338
Orlando                338
Philadelphia           338
PhoenixTucson          338
Pittsburgh             338
Plains                 338
Portland               338
RaleighGreensboro      338
RichmondNorfolk        338
Roanoke                338
SanDiego               338
Atlanta                338
SanFrancisco           338
Seattle                338
SouthCarolina          338
SouthCentral           338
Southeast              338
Spokane                338
StLouis                338
Syracuse               338
Tampa                  338
TotalUS                338
West                   338
NewYork                338
NewOrleansMobile       338
Nashville              338
Midsouth               338
BaltimoreWashington    338
Boise                  338
Boston                 338
BuffaloRochester       338
California             338
Charlotte              338
Chicago                338
CincinnatiDayton       338
Columbus               338
DallasFtWorth          338
Denver                 338
Detroit                338
GrandRapids            338
GreatLakes             338
HarrisburgScranton     338
HartfordSpringfield    338
Houston                338
Indianapolis           338
Jacksonville           338
LasVegas               338
LosAngeles             338
Louisville             338
MiamiFtLauderdale      338
WestTexNewMexico       335
Name: region, dtype: int64

In [78]:
# Renomeia aqueles que estão iniciando em letra minúscula para que iniciem em letra maiúscula.
df = df.rename(columns=lambda coluna: coluna.capitalize())
df = df.drop(columns='Unnamed: 0')
df.head()

         Date  Averageprice  Total volume  Year  Region          Type
0  2015-12-27          1.33      64236.62  2015  Albany  conventional
1  2015-12-20          1.35      54876.98  2015  Albany  conventional
2  2015-12-13          0.93     118220.22  2015  Albany  conventional
3  2015-12-06          1.08      78992.15  2015  Albany  conventional
4  2015-11-29          1.28      51039.60  2015  Albany  conventional

In [79]:
# Remove a coluna que apresenta o ano.

df = df.drop(columns='Year')
df.head()

         Date  Averageprice  Total volume  Region          Type
0  2015-12-27          1.33      64236.62  Albany  conventional
1  2015-12-20          1.35      54876.98  Albany  conventional
2  2015-12-13          0.93     118220.22  Albany  conventional
3  2015-12-06          1.08      78992.15  Albany  conventional
4  2015-11-29          1.28      51039.60  Albany  conventional